Repository: marekprochazka/MarkoGebra-docs
Catalog: webface/docs/locale/*/LC_MESSAGES/django.po
Languages: cs

source: About
cs: O aplikaci

source: MarkoGebra is a high school graduation project of a technical lyceum student in Czech city Olomouc. The goal of the project is to create a user-friendly and understandable environment to create different types of graphs, which, however, has very extensible possibilities.
cs: MarkoGebra je středoškolská maturitní práce studenta technického lycea v Olomouci. Cílem práce je vytvořit uživatelsky jednoduše ovladatelné a pochopitelné prostředí pro tvorbu různých druhů grafů, které má ovšem velmi rozsáhlé možnosti.

source: The project is written in Python programming language using mainly Tkinter, matplotlib and numpy libraries. A simple sqllite database then runs on the backend. The project is publicly available
cs: Projekt je napsaný v jazyce python za využití převážně knihoven Tkinter, matplotlib a numpy. Na backendu poté běží jednoduchá sqllite databáze. Projekt je veřejně k nahlédnutí

source: here
cs: zde

source: Although the application tries to be as simple and user-friendly as possible, so do some functions may not be completely clear at first glance. This documetation should be used for clarification of this functions. Also available discussion may be helpful.
cs: I když se aplikace snaží být co nejjednodušší a uživatelsky přátelská, tak některé funkce mohou být ne vždy úplně jasné na první pohled. K objasnění by měla sloužit tato dokumentace, popřípadě může být nápomocná i dostupná diskuze.

source: I hope you enjoy the app.
cs: Doufám, že se Vám bude aplikace líbit.

source: Kindest regards, Mark
cs: Marek

source: Environment and methods
cs: Prostředí a metody

source: Installation
cs: Instalace

source: Discussion
cs: Diskuze

source: How to use
cs: Návod k použití

source: Environment
cs: Prostředí

source: Graphing in the app is divided into 4 methods. Mathematical, Pie, Bar graphing and Random Noise. The Current graphing method is displayed in the upper left corner of the app and you can switch to another method by clicking on it.
cs: Tvorba grafů je v aplikaci rozdělena na 4 metody. Matematické, Koláčové, Sloupcové grafování a Náhodný šum. Aktuální metoda je zobrazena v levém horním rohu. Kliknutím na ni se dá přepnout do jiné metody.

source: In the upper right corner of the app there are 4 buttons: Graph style, delete all, save as image and help referring to this documentation.
cs: V pravém horním rohu aplikace naleznete 4 tlačítka: Styl grafu, Smazat vše, uložit jako obrázek a Nápověda.

source: In the left part of the window tehre is a space intended for working with the graph and it's data, in the right part there is a graph.
cs: V levé části okna se nachází prostor sloužící k práci s grafem a jeho daty. Napravo se nachází graf.

source: Graph style
cs: Styl grafu

source: A graph can have several different style. Each style changes the layout part of the chart. For example if it would have grid or not, if it will have axes description of which background color will graph have.
cs: U grafu si můžete zvolit z několika různých stylů. Každý styl mění určitým způsobem vzhled grafu. Pro příklad růžné styly mohou, ale nemusí mít mřížku, mohou mít různé velikosti popisných os a také různé barvy pozadí.

source: Delete all
cs: Smazat vše

source: This Button will delete all of the current user's inputs.
cs: Tlačítko smaže všechny uživatelské vstupy.

source: Save as img
cs: Uložit jako obrázek

source: The 'save as image button' opens a new window for saving the image. here you need to write the name of the future image and specify the location of the file by clicking on the 'location' button. You can then decide whether you want to save the graph with the axis description or without it.
cs: Funkce 'uložit jako obrázek' otevře nové okno, ve kterém se specifikují parametry uložení obrázku. Je třeba zadat jméno a lokaci uložení. Je zde také možnost vypnout popisky os.

source: Help
cs: Nápověda

source: Help button will open this documentation.
cs: Tlačítko nápovědy otevře tuto dokumentaci.

source: Graphing methods
cs: Metody grafování

source: Each graphic method has it's specific user input, setting a graph output.
cs: Každá metoda má své specifické uživatelské vstupy, nastavení a výstupy na grafu.

source: Mathematical
cs: Matematická

source: Mathematical method is divided into two outputs. The course of the function and the point. Result output depends on the input type you will choose in the top left. You can either use first row with inputs for X and Y to get a point in a graph or a second line, where you will write the right part of the function like for example '(x + 2)/2' Functional inputs has some specific syntax similar to python operations, here's the allowed syntax:
cs: Matematická metoda je rozdělena do dvou výstupů. Do průběhu funkce a do bodového výstupu. Výsledný výstup záleží na typu vstupu, který si zvolíte. Můžete si vybrat buď první řádek se vstupy X a Y, jejichž výsledkem bude bod, nebo druhý řádek, kde zapíšete pravou stranu funkce (například 'x+2'). Funkcionální vstup má svou specifickou syntaxi podobnou jazyku python. Zde jsou povolené znaky:

source: sin, cos, tan, ln, pi, e - functions and constants
cs: sin, cos, tan, ln, pi, e - funkce a konstanty

source: +, -, *, /, (, ) - operations, brackets
cs: +, -, *, /, (, ) - operace a závorky

source: numbers - floating numbers are written with dot, not a comma
cs: čísla - desetinná čísla se píší s desetinnou tečkou, nikoliv čárkou

source: letter 'x' represents variable
cs: písmeno 'x' reprezentuje neznámou

source: The mathematical method has two extra settings. The first one is limiting values of each axis, which is in the default set to auto set. And the second one is the grid setting where you can change the line type, color, and size of the graph's grid.
cs: Matematická metoda má dvě speciální nastavení. První je nastavení limit os X a Y, které je v základu nataveno do režimu 'auto'. Druhé nastavení je nastavení mřížky grafu. Nastavit lze druh čáry, barvu a tloušťku čáry.

source: In the list view, you can edit values from inputs and also two extra values, which are size and type of line/point.
cs: V seznamu hodnot lze upravovat hodnoty vstupní a velikost a značku výstupní čáry/bodu.

source: Pie
cs: Koláčový graf

source: The output of the next method is the values represented in the pie chart. As an input, you will write the name and numeric value of the pie slice. You can also choose a color or keep the default blue. This method doesn't have any special setting. In the list view, you can edit input values and explode value which cause the pie slice to stump from the chart.
cs: Výstupem následující metody jsou vstupní hodnoty zobrazeny v koláčovém grafu. Jako vstup zadáte jméno a číselnou hodnotu jedné výseče koláčového grafu. Můžete také nastavit barvu nebo ponechat základní modrou. Tato metoda nemá žádná speciální nastavení V seznamu výstupů můžete upravovat vstupní hodnoty a hodnotu výstupu výřezu.

source: Bar
cs: Sloupcový graf

source: Another method is called bar. In the output, the input values will be organized into a bar graph. As an input, you will write the name and numeric value of the bar column. You can also choose a color or keep the default blue. This method doesn't have any special setting. In the list view, you can edit input values and width value which sets the width of the bar column.
cs: Výstupem této metody je sloupcový graf do kterého jsou zaneseny jednotlivé uživatelské vstupy. Na vstupu zadáte název sloupce a jeho numerickou hodnotu. Můžete také určit barvu nebo ponechat základní modrou. Tato metoda nemá žádné unikátní nastavení. V seznamu výstupů můžete upravovat vstupní hodnoty a šířku jednotlivých sloupců.

source: Noise
cs: Náhodný šum

source: The last method is random noise. As input, you will choose the dispersion of the noise and the number of points in it. You will create one by clicking on generate button. To get a different generation with the same dispersion and count values you can just click generate again. When you're satisfied with the generation you can lock it with the lock button. This method has one special setting. Same as in Math method you can edit grid here. In the list view, you can edit input values and the type of noise points.
cs: Poslední metodou je náhodný šum. Jako vstup zvolíte rozptyl šumu a počet bodů v něm. Šum vytvoříte kliknutím na tlačítko generovat. Chcete-li jinou generaci se stejným rozptylem a množstvím bodů, stačí kliknout znovu na generovat. Pokud jste s generací spokojeni, můžete ji zamknout pomocí tlačítka uzamknout. V zobrazení seznamu můžete upravit vstupní hodnoty a typ bodů šumu.

source: How to install and run
cs: Instalace a spuštění

source: Go to
cs: Otevřete

source: the project's repository.
cs: projektový repositář.

source: Clone/download repository.
cs: Naklonujte/stáhněte repositář.

source: If you're using windows
cs: Pokud používáte windows

source: Open a command prompt and navigate to the project's folder.
cs: Otevřete příkazový řádek a přesuňte se do složky projektu.

source: Run 'init.bat' in prompt.
cs: V příkazové řádce spusťte soubor 'init.bat'.

source: To run the app type 'python app.py'.
cs: Pro zpuštění aplikace napište do příkazové řádky 'python app.py'.

source: If you're using another OS
cs: Pokud používáte jiný operační systém

source: Navigate to the project's folder with a command prompt.
cs: Za pomocí příkazového řádku se přesuňte do složky projektu.

source: Create a virtual environment.
cs: Vytvořte pythonovské virtuální prostředí.

source: Install 'requirements.txt'.
cs: Nainstalujte 'requirements.txt'.

source: Navigate to the Data folder.
cs: Přesuňte se do podsložky Data.

source: Type 'python startDB.py'.
cs: Spusťte 'python startDB.py'.

source: In the Data folder create 'math_limits.json' with empty dict '{}'.
cs: Ve složce Data vytvořte soubor 'math_limit.json', jejímž obsahem bude prázdný slovník '{}'.

source: In the Data folder create a 'graphstyle.txt' file and write a 'seaborn' to it without making a new line.
cs: Ve složce Data vytvořte soubor 'graphstyle.txt' a zapište do něj 'seaborn' (bez odřádkování).

source: Return to root folder.
cs: Vraťte se do hlavní složky.

source: Note
cs: Poznámka

source: Please make sure you've got installed python on version 3.7.9. and you have it set as the Path variable.
cs: Ujistěte se prosím, že máte nainstalovaný python ve verzi 3.7.9. a že ho máte nastavený v proměnách prostředí (Path).

source: If you want to run the app after it's already installed you also need to activate the virtual environment of the app or install the requirements globally.
cs: Aktivovat virtuální prostředí je potřeba před každým spuštěním aplikace. Alternativní řešení je nainstalovat si requirements.txt globálně.
